In [1]:
import pandas as pd
df = pd.read_csv('homeprices.csv')
df.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [2]:
df= df.fillna(df.median())

In [3]:
df.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   area      6 non-null      int64
 1   bedrooms  6 non-null      float64
 2   age       6 non-null      int64
 3   price     6 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 320.0 bytes

In [5]:
df.shape

(6, 4)

In [6]:
from sklearn.linear_model import LinearRegression

In [7]:
model = LinearRegression()

In [8]:
X = df.drop('price', axis=1)
y = df.price

In [9]:
X.head()

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8

In [10]:
y.head()

0    550000
1    565000
2    610000
3    595000
4    760000
Name: price, dtype: int64

In [11]:
model.fit(X,y)

LinearRegression()

In [12]:
model.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [13]:
model.intercept_

221323.00186540408

In [14]:
import joblib

joblib.dump(model, 'homemodel.pkl')

['homemodel.pkl']

In [15]:
joblib.load('homemodel.pkl')
print("This is a model to predict the Price of a House")
age = int(input("Age of the House:\n"))
bed = int(input('Number of bedrooms:\n'))
area_of = int(input('Area of the house:\n'))

predictions = model.predict([[area_of,bed,age]])
print(str(f"The price of the house is ${predictions}"))

This is a model to predict the Price of a House
Age of the House:
20
Number of bedrooms:
3
Area of the house:
2900
The price of the house is $[551836.36555875]